//
// This file contains an 'Intel Peripheral Driver' and is
// licensed for Intel CPUs and chipsets under the terms of your
// license agreement with Intel or your vendor.  This file may
// be modified by the user, subject to additional terms of the
// license agreement
//
// *++
//
// Copyright (c) 2016 Intel Corporation. All rights reserved
// This software and associated documentation (if any) is furnished
// under a license and may only be used or copied in accordance
// with the terms of the license. Except as permitted by such
// license, no part of this software or documentation may be
// reproduced, stored in a retrieval system, or transmitted in any
// form or by any means without the express written consent of
// Intel Corporation.
//

//---------------------------------------------------------------------------
// USB CONFIGURATION
//---------------------------------------------------------------------------
//
// USB Configuration
//

/=#

#langdef   en-US "English"

#string STR_NETWORK_CONFIGURATION       #language en-US "Network Configuration"
#string STR_NETWORK_CONFIGURATION_HELP  #language en-US "Network Configuration"

#string STR_PCH_PXEROM_CONTROL          #language en-US "Legacy PXE ROM"
#string STR_PCH_PXEROM_CONTROL_HELP     #language en-US "Enable/Disable Legacy PXE Option ROM execution for LANs."

#string STR_EFI_NETWORK_CONTROL         #language en-US "EFI Network"
#string STR_EFI_NETWORK_CONTROL_HELP    #language en-US "Enable/Disable EFI Network support for LANs."

#string STR_EFI_NETWORK_GPE27         #language en-US "Force GPE27 on Sx path"
#string STR_EFI_NETWORK_GPE27_HELP    #language en-US "Sets the GPE27 (Bit 70 of GPE block) on the Sx path regardless the OS configuration"

#string STR_PCH_LAN_CONTROLLER                  #language en-US "PCH LAN Controller"
#string STR_PCH_LAN_CONTROLLER_HELP             #language en-US "Enable/Disable onboard NIC."
#string STR_PCH_WOL_LAN_WAKE                    #language en-US "LAN PHY Drives LAN_WAKE#"
#string STR_PCH_WOL_LAN_WAKE_HELP               #language en-US "Enables/Disables LAN Phy driving LAN_WAKE# else platform drives LAN_WAKE#"
#string STR_PCH_LAN_WOL_PROMPT                  #language en-US "  Wake on LAN Enable"
#string STR_PCH_LAN_WOL_HELP                    #language en-US "Enable/Disable integrated LAN to wake the system."

//
// End of file
//
